openfoam/OpenFOAM-dev/tutorials/incompressibleVoF/DTCHullMoving/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rigidBodyForces
{
    type            rigidBodyForces;
    libs            ("librigidBodyForces.so");
    body            hull;
    patches         (hull);
    log             on;
    writeControl    timeStep;
    writeInterval   1;
}

// ************************************************************************* //
